"""
正则表达式元字符练习
"""
import re
#1.匹配出大写字母开头的单词
# s=re.findall("[A-Z][a-z]*","How are you,Jame")
# print(s)

#2.匹配出数字
# s="小明身高:175cm 体重 70kg"
# a=re.findall("[0-9]+",s)
# print(a)

# 3.匹配出文字中的数字
# s="当前海拔：83米,温度:-22度"
# print(re.findall("-?[0-9]+", s))

#4.匹配国内的手机号码
# 13 15 17 18
# print(re.findall("1[3578][0-9]+", "15957894569 19874895632"))

#5.匹配一下日期
# print(re.findall("[0-9]{4}-[0-9]{1,2}-[0-9]{1,2}", "2020-11-12"))

#6.匹配qq号码
# print(re.findall("[1-9][0-9]{5,10}","895854566"))

#7.匹配大写字母开头的单词
# s="Hello,A boy iPython NBA"
# print(re.findall(r"\b[A-Z]+[a-z]*", s))

#8.匹配数字
#12 -23 1.56 -4.8
# print(re.findall(r"-?\d+\.?\d*", "12 -23 1.56 -4.8"))

# 9.匹配日薪数据
# 你的日薪：$120
# print(re.findall("\$\d+", "你的日薪：$120"))

#10.匹配如下书名
#《走在2020～～》  《奥特曼 @@ 小怪兽》  《啦啦啦啦 。。。。发》
# print(re.findall("/《.+?》", "《走在2020～～》  《奥特曼 @@ 小怪兽》  《啦啦啦啦 。。。。发》"))

#11.匹配IP地址
print(re.search(r"(\d{1,3}\.){3}\d{1,3}", "192.156.2.3").group())